import re

text = """
总奖励为-56，成功调度流量为472
总奖励为34，成功调度流量为517
总奖励为132，成功调度流量为566
总奖励为162，成功调度流量为581
总奖励为232，成功调度流量为616
总奖励为284，成功调度流量为642
总奖励为296，成功调度流量为648
总奖励为310，成功调度流量为655
总奖励为340，成功调度流量为670
总奖励为356，成功调度流量为678
总奖励为388，成功调度流量为694
总奖励为438，成功调度流量为719
总奖励为490，成功调度流量为745
总奖励为442，成功调度流量为721
总奖励为456，成功调度流量为728
总奖励为432，成功调度流量为716
总奖励为504，成功调度流量为752
总奖励为480，成功调度流量为740
总奖励为530，成功调度流量为765
"""

import matplotlib.pyplot as plt

# 使用正则表达式提取数字
numbers = re.findall(r'\d+', text)

print(numbers)

result = []
# 打印提取到的数字
for i in range(int(len(numbers)/2)):
    result.append(numbers[2*i + 1])

num_result = [int(num) for num in result]

print(num_result)

